--------------------------------------------------------------------------------
-- Initialization --------------------------------------------------------------
--------------------------------------------------------------------------------

INSERT INTO db.locale (id, code, name, description) VALUES ('00000000-0000-4001-a000-000000000001', 'en', 'English', 'English - United States');
INSERT INTO db.locale (id, code, name, description) VALUES ('00000000-0000-4001-a000-000000000002', 'ru', 'Русский', 'Русский язык');

